[
  {
    "title": "n8n & AI: Event-Driven Customer Support System",
    "slug": "event-driven-ai-support-decision-routing-system",
    "description": "An event-driven n8n automation system that classifies incoming customer messages, retrieves contextual knowledge using vector search, and generates consistent, automated responses.",
    "longDescription": "Context\nHandling customer communication at scale is not a tooling problem — it is a\ndecision problem. Incoming messages vary in intent, urgency, relevance, and\nrequired context, yet most systems rely on either manual handling or rigid,\nrule-based automation.\n\nThis results in wasted effort, inconsistent responses, and poor reuse of\norganizational knowledge.\n\nWhat I Built\nI designed an event-driven AI support intelligence system using n8n that treats every\nincoming message as a decision to be evaluated, not a ticket to be processed.\n\nThe system listens to live communication channels (email and chat), determines\nwhether a message actually requires attention, retrieves the right internal\ncontext when needed, and generates structured responses using an AI agent —\nwithout hard-coded rules or static workflows.\n\nHow the System Works in Practice\nWhen a message arrives:\n- It is first classified to understand intent and relevance\n- Non-actionable or low-signal messages are filtered out early\n- Relevant queries trigger contextual retrieval from internal documents\n- An AI agent reasons over both the message and retrieved context\n- The final response is generated and sent automatically, with memory retained\n  for future interactions\n\nEach step exists to reduce unnecessary AI calls, control behavior, and keep the\nsystem predictable rather than “chatty”.\n\nDesign Decisions That Matter\nThis system was intentionally designed around control and clarity:\n- Classification is used to avoid blindly responding to everything\n- Vector retrieval replaces brittle rule-based logic\n- AI is treated as a reasoning layer, not a decision-maker\n- Routing logic is explicit, not hidden inside prompts\n- Components are modular to allow reuse across other workflows\n\nThe result is a system that behaves consistently, scales cleanly, and remains\nauditable.\n\nWhy This Is Useful Beyond Support\nWhile implemented in a customer support context, the same architecture applies\nto:\n- Internal operations queries\n- Research and document-heavy workflows\n- Finance and reporting support systems\n- Consulting-style analysis pipelines\n- Any environment where inputs must be evaluated before action\n\nThis project demonstrates how AI can be embedded into real decision workflows\nwithout turning the system into a black box.\n",
    "category": "n8n Automation, AI Agents, Decision Intelligence",
    "imageUrl": "/uploads/Customer Support System-1769614188640-624806464.png",
    "date": "2026-01-28",
    "tags": [
      "n8n",
      "AI",
      "Automation"
    ],
    "status": "published",
    "metrics": {},
    "featured": true,
    "id": "1769611007542",
    "createdAt": "2026-01-28T14:36:47.542Z",
    "updatedAt": "2026-01-28T15:29:50.798Z"
  },
  {
    "title": "AI-Driven Invoice Processing & Reconciliation System",
    "slug": "ai-driven-invoice-processing-reconciliation-system",
    "description": "An AI-driven system that ingests invoices, extracts structured financial data, validates records, and automates reconciliation workflows to reduce manual finance operations effort.",
    "longDescription": "Context\nInvoice handling in most organizations is still a manual, error-prone process.\nDocuments arrive in multiple formats, data must be extracted and validated,\nand reconciliation often depends on human checks across spreadsheets and systems.\n\nThis creates delays, inconsistencies, and operational risk — especially as\ninvoice volume scales.\n\nWhat I Built\nI designed an AI-driven invoice processing system that treats invoices as\nstructured financial inputs rather than static documents.\n\nThe system ingests invoice files automatically, extracts relevant financial\nfields, validates the data, and appends clean, structured records into a\ncentralized ledger for downstream processing and review.\n\nHow the System Works in Practice\nWhen new invoice files are detected:\n- Files are discovered and downloaded automatically\n- Each document is analyzed and parsed using AI-based extraction\n- Key fields such as invoice number, vendor, amount, and dates are identified\n- Extracted data is normalized and validated through custom logic\n- Clean records are appended into a structured finance sheet\n- The system loops continuously to handle multiple invoices without manual input\n\nThe workflow is designed to minimize human intervention while maintaining\ncontrol over data quality.\n\nDesign Decisions That Matter\nThis system prioritizes reliability over novelty:\n- Explicit looping and validation to prevent partial ingestion\n- AI used for extraction, not blind automation\n- Custom logic layers to enforce consistency before storage\n- Separation between document analysis and financial record creation\n\nThe goal is predictable, auditable finance operations — not black-box automation.\n\nWhy This Is Useful Beyond Invoices\nWhile implemented for invoice workflows, the same architecture applies to:\n- Expense processing\n- Financial document normalization\n- Ops and compliance reporting\n- Back-office automation in finance teams\n\nThis project demonstrates how AI can be embedded into finance operations\nwithout sacrificing control or traceability.\n",
    "category": "AI, Finance Operations, Automation",
    "imageUrl": "/uploads/Invoice Management System-1769614203053-831987424.png",
    "date": "2026-01-28",
    "tags": [],
    "status": "published",
    "metrics": {},
    "featured": true,
    "id": "1769614277519",
    "createdAt": "2026-01-28T15:31:17.519Z",
    "updatedAt": "2026-01-28T15:31:17.519Z"
  },
  {
    "title": "Zomato Strategic & Valuation Analysis",
    "slug": "zomato-strategic-valuation-analysis",
    "description": "A consulting-style strategic and valuation analysis of Zomato, combining discounted cash flow valuation, competitive benchmarking, and scenario-based strategic recommendations.",
    "longDescription": "Context\nHigh-growth consumer internet companies often trade at significant premiums\nto intrinsic value, driven by future optionality rather than current cash\nflows. Understanding whether these premiums are justified requires combining\nrigorous valuation with strategic analysis.\n\nThis project analyzes Zomato as a listed Indian consumer-tech company operating\nacross food delivery and quick commerce, with a specific focus on Blinkit-led\ngrowth expectations.\n\nWhat I Did\nI conducted a full investment-banking-style valuation and a consulting-style\nstrategic assessment to evaluate whether Zomato’s market pricing is supported\nby fundamentals and strategy.\n\nThe analysis integrates financial modeling, market sizing, competitive\nbenchmarking, and scenario-based strategic reasoning.\n\nValuation & Financial Analysis\n- Built a bottom-up DCF valuation with explicit revenue, margin, and cash flow\n  assumptions\n- Performed common-size P&L analysis and benchmarking against key competitors\n- Evaluated capital efficiency and profitability trends post scale-up\n\nKey valuation output:\n- Enterprise Value (DCF): ₹72,035 Cr\n- Equity Value: ₹66,376 Cr (WACC 10%, terminal growth 5%)\n- Market capitalization at analysis: ~₹2.9 Lakh Cr\n\nThe valuation gap indicates the market is pricing in strong long-term optionality,\nprimarily driven by Blinkit and adjacent growth opportunities.\n\nStrategic Analysis\nThe strategic assessment focused on:\n- Market sizing for Indian food delivery and quick commerce\n- Unit economics and scalability of Blinkit\n- Competitive positioning and execution risk\n- Sustainability of current profitability trends\n\nThree strategic scenarios were evaluated:\n- Aggressive growth prioritization\n- Profitability-first optimization\n- Balanced growth with disciplined capital allocation\n\nKey Conclusion\nWhile Zomato’s current market valuation exceeds intrinsic value based on\nconservative cash flow assumptions, a balanced growth strategy provides the\nmost sustainable path forward — preserving profitability while selectively\ninvesting in high-return growth segments.\n\nWhy This Project Matters\nThis project demonstrates the ability to:\n- Translate financial models into strategic insight\n- Combine valuation rigor with consulting frameworks\n- Evaluate market expectations versus fundamentals\n- Communicate complex analysis in a decision-oriented narrative\n\nThe approach mirrors how investment banks and consulting firms assess\nhigh-growth public companies.\n",
    "category": "Corporate Finance, Strategy, Valuation",
    "imageUrl": "/uploads/Screenshot 2025-09-02 at 11.49.27 AM-1769616353481-719813799.png",
    "date": "2026-01-28",
    "tags": [],
    "status": "published",
    "metrics": {},
    "id": "1769616420052",
    "createdAt": "2026-01-28T16:07:00.052Z",
    "updatedAt": "2026-01-28T16:07:00.052Z"
  },
  {
    "title": "Transaction Fraud Detection & Risk Scoring System",
    "slug": "transaction-fraud-detection-risk-scoring-system",
    "description": "A machine-learning–driven system that analyzes transactional data, identifies anomalous patterns, and flags high-risk transactions through a live, interactive decision interface.",
    "longDescription": "Context\nFraud detection is fundamentally a risk assessment problem, not just a\nclassification task. Financial transactions exhibit complex patterns where\nfalse positives increase operational cost and false negatives expose the\nsystem to direct losses.\n\nEffective fraud systems must balance accuracy, interpretability, and\nreal-time usability.\n\nWhat I Built\nI designed an end-to-end fraud detection system that transforms raw\ntransaction data into actionable risk signals through a structured\nmachine learning pipeline and a live decision interface.\n\nThe system separates model development from deployment, enabling scalable\nand repeatable fraud analysis without retraining overhead.\n\nHow the System Works in Practice\nThe workflow follows a production-oriented pipeline:\n- Transaction data is cleaned, preprocessed, and feature-scaled\n- A supervised machine learning model is trained to identify anomalous\n  transaction behavior\n- The trained model is serialized using joblib for efficient reuse\n- A live web interface allows users to submit transactions for analysis\n- Each transaction is evaluated in real time and flagged based on risk\n  probability rather than binary outcomes\n\nThis design allows stakeholders to interpret results as decision support,\nnot absolute truth.\n\nDesign Decisions That Matter\nKey choices were made to reflect real-world constraints:\n- Separation of training and inference to ensure system stability\n- Model persistence to avoid unnecessary retraining\n- Focus on risk scoring instead of hard yes/no decisions\n- Lightweight deployment to support fast iteration and usability\n\nThe emphasis was on building a reliable decision layer rather than optimizing\nfor leaderboard-style metrics.\n\nWhy This Matters Beyond Fraud\nThe same architecture generalizes to:\n- Credit risk assessment\n- Transaction monitoring systems\n- Compliance and anomaly detection\n- Operational risk analytics\n\nThis project demonstrates how machine learning can be embedded into\nrisk-sensitive financial workflows without turning the system into a\nblack box.\n",
    "category": "Machine Learning, Risk Analytics, Financial Systems",
    "imageUrl": "/uploads/Screenshot 2026-01-28 at 9.40.29 PM-1769616643599-549279520.png",
    "date": "2026-01-28",
    "tags": [],
    "status": "published",
    "metrics": {},
    "id": "1769616682838",
    "createdAt": "2026-01-28T16:11:22.838Z",
    "updatedAt": "2026-01-28T16:11:22.838Z"
  },
  {
    "title": "Banking Transactions & Customer Analytics Dashboard",
    "slug": "banking-transactions-customer-analytics-dashboard",
    "description": "An interactive Power BI dashboard designed to analyze banking transactions and customer behavior across geographies, enabling data-driven insights for revenue, customer segmentation, and payment trends.",
    "longDescription": "Context\nBanks and financial institutions generate large volumes of transactional data,\nbut decision-making often relies on static reports or fragmented views of\ncustomer activity.\n\nTo be useful, analytics dashboards must go beyond visualization and enable\nclear interpretation of revenue drivers, customer behavior, and geographic\npatterns.\n\nWhat I Built\nI developed an interactive Power BI dashboard that consolidates banking\ntransaction and customer data into a single analytical view.\n\nThe dashboard is designed to help stakeholders quickly understand how revenue,\ncustomer segments, and transaction behavior vary across regions, categories,\nand payment methods.\n\nWhat the Dashboard Enables\nThe dashboard provides:\n- Revenue and transaction-level performance metrics\n- Active customer tracking and average transaction value\n- Geographic analysis across key global markets\n- Customer segmentation by demographics and behavior\n- Category and subcategory-level transaction breakdown\n- Payment method analysis across different transaction types\n\nInteractive filters allow users to dynamically explore trends by year,\ncategory, and subcategory without rebuilding reports.\n\nDesign Decisions That Matter\nThe focus was on clarity and usability:\n- KPIs prioritized at the top for immediate visibility\n- Geographic and segment-level views to identify concentration risk\n- Filters designed to support exploratory analysis, not static reporting\n- Visual hierarchy optimized for executive-level consumption\n\nThe dashboard emphasizes interpretability over visual complexity.\n\nWhy This Matters\nThis project demonstrates the ability to translate raw transactional data into\ndecision-support analytics for financial services use cases.\n\nThe same approach applies to:\n- Retail banking analytics\n- Customer profitability analysis\n- Transaction monitoring and reporting\n- Business performance dashboards for finance teams\n\nIt highlights how structured analytics can support informed decisions without\nrequiring advanced modeling.\n",
    "category": "Data Analytics, Financial Services, Business Intelligence",
    "imageUrl": "/uploads/dashboard image 3-1769617102142-959295601.jpeg",
    "date": "2026-01-28",
    "tags": [],
    "status": "published",
    "metrics": {},
    "id": "1769617205170",
    "createdAt": "2026-01-28T16:20:05.170Z",
    "updatedAt": "2026-01-28T16:20:05.172Z"
  },
  {
    "title": "Automated Financial Statement & Ratio Analysis Model (Excel)",
    "slug": "automated-financial-statement-ratio-analysis-model-excel",
    "description": "An automated Excel-based financial analysis model compatible with Screener-style data, combining ratio computation and an integrated dashboard to support structured company evaluation.",
    "longDescription": "Context\nEquity analysis often starts with financial data exported from platforms such as\nScreener, but raw data alone is not decision-ready. Analysts typically spend\nsignificant time cleaning inputs, recalculating ratios, and building views to\ninterpret performance trends.\n\nThis friction slows down screening and introduces inconsistency across analyses.\n\nWhat I Built\nI built an automated Excel-based financial analysis model designed to work with\nScreener-compatible financial data formats.\n\nThe model ingests standardized financial statements, structures them\nautomatically, computes key financial ratios, and presents insights through an\nintegrated Excel dashboard for quick interpretation.\n\nWhat the Model Enables\nThe model supports:\n- Direct ingestion of Screener-exported financial data\n- Automated structuring of income statement, balance sheet, and cash flow data\n- Formula-driven computation of profitability, liquidity, and leverage ratios\n- Trend analysis across reporting periods\n- A dashboard view summarizing key financial metrics and signals\n- Rapid identification of strengths, weaknesses, and potential red flags\n\nThe emphasis is on speed, consistency, and repeatability of analysis.\n\nDesign Decisions That Matter\n- Input sheets aligned with Screener’s export structure\n- Clear separation between raw inputs, calculations, and dashboard outputs\n- Automation through formulas rather than manual recalculation\n- Ratios and visuals chosen for analytical relevance, not quantity\n\nThis design allows the sheet to function as a reusable screening and analysis\ntool rather than a one-off spreadsheet.\n\nWhy This Matters\nThis project demonstrates a strong foundation in accounting and financial\nanalysis, along with the ability to translate raw financial data into structured,\ndecision-ready insights.\n\nIt reflects practical analyst workflows and serves as a base layer for more\nadvanced automation and AI-driven financial systems.\n",
    "category": "Financial Analysis, Accounting, Decision Support",
    "imageUrl": "/uploads/Screenshot 2026-01-28 at 9.56.17 PM-1769617586799-64775993.png",
    "date": "2026-01-28",
    "tags": [],
    "status": "published",
    "metrics": {},
    "id": "1769617640280",
    "createdAt": "2026-01-28T16:27:20.280Z",
    "updatedAt": "2026-01-28T16:27:20.280Z"
  }
]